USE JavaUniversity;

CREATE TABLE IF NOT EXISTS students
(
    id               INT PRIMARY KEY AUTO_INCREMENT,
    first_name       VARCHAR(255) NOT NULL,
    last_name        VARCHAR(255) NOT NULL,
    patronymic       VARCHAR(255) NOT NULL,
    birthday         DATE         NOT NULL);

INSERT INTO students (lastName,
                      firstName,
                      patronymic,
                      birthDate)
VALUES ('Бережний', 'Микита', 'Анатолійович', '2000-01-01'),
       ('Ольховик', 'Дмитро', 'Володимирович', '2000-02-01'),
       ('Коротун', 'Сергій', 'Володимирович', '2000-03-01'),
       ('Самойленко', 'Діана', 'Дмитрівна', '2000-04-01'),
       ('Гречук', 'Діана', 'Вадимівна', '2000-05-01'),
       ('Димарьова', 'Марія', 'Костянтинівна', '2000-07-01'),
       ('Лєвін', 'Єгор', 'Геннадійович', '2000-08-01'),
       ('Манахін', 'Михайло', 'Олександрович', '2000-09-01'),
       ('Музичук', 'Денис', 'Сергійович', '2000-10-01'),
       ('Пирогов', 'Олександр', 'Олександрович', '2000-11-01'),
       ('Шаповалов', 'Євген', 'Вікторович', '2000-12-01');